Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - The key is the original text in English and the value is the translation of the corresponding language
ja: - キーは英語で書かれたオリジナルのテキストで、値は対応する言語への訳文です。

source: - ``getExternalId()``: Get external id (Unique id)
ja: - ``getExternalId()``: 外部ID (ユニークな id) を取得する

source: Titles ------
ja: 見出し ------

source: After a successful authentication, the last registered ``PostAuthenticationProviderInterface`` will be used 6.
ja: 認証が成功した後は、最後に登録されている ``PostAuthenticationProviderInterface`` が使用されます。 6.

source: Kanboard works well with any great VPS hosting provider such as `Digital Ocean <https://www.digitalocean.com/?refcode=4b541f47aae4>`__, `Linode <https://www.linode.com/?r=4e381ac8a61116f40c60dc7438acc719610d8b11>`__ or `Gandi <https://www.gandi.net/>`__.
ja: Kanboardは、 `Digital Ocean <https://www.digitalocean.com/?refcode=4b541f47aae4>`__ や`Linode <https://www.linode.com/?r=4e381ac8a61116f40c60dc7438acc719610d8b11>`__ ,あるいは `Gandi <https://www.gandi.net/>`__ のような、優れたVPSホスティングサービスでうまく動かせます。

source: - ``--show``: Display notifications sent
ja: - ``--show``: 送信する通知を表示

source: This de facto standard has been adopted by a number of tools.
ja: これは数多くあるデファクトスタンダードとして採用されたツールです。

source: In your Kanboard ``config.php``:
ja: Kanboard 内の``config.php`` では:

source: You can use this feature to create a theme and override all Kanboard default styles.
ja: この特徴を利用すると、新しいテーマを作成して Kanboard のデフォルトのスタイルをオーバーライドすることができます。

source: - ``getInternalId()``: Get internal database id
ja: - ``getInternalId()``: 内部データベース上のIDを取得する

source: +-------------------+-------------------+ | Device | Screen resolution | +===================+===================+ | Laptop or desktop | >= 1366 x 768 | +-------------------+-------------------+ | Tablet | >= 1024 x 768 | +-------------------+-------------------+
ja: +-------------------+-------------------+ | デバイス | 解像度 | +===================+===================+ | ノート/デスクトップ | 1366 x 768以上 | +-------------------+-------------------+ | タブレット | 1024 x 768以上 | +-------------------+-------------------+

source: Example for LDAPS (SSL-encryption) ----------------------------------
ja: LDAPS (SSLによる暗号化) の例 ----------------------------------

source: // Enable/disable remember me authentication
ja: // remembarme認証の有効化/無効化

source: Click on the link **Add a new automatic action**.
ja: **新しいアクションを追加** のリンクをクリックしてください。

source: External task providers must implements at least two interfaces:
ja: 外部タスクのプロバイダは少なくとも2つのインターフェースを持たなければなりません:

source: - **Create another task**: Check this box if you want to create a similar task (some fields will be pre-filled).
ja: - **続けて別のタスクを作成**: ここにチェックを入れると、よく似たタスクを続けて作成します (いくつかのフィールドが埋められます)

source: - If enabled, closed tasks will be included in the cumulative flow diagram.
ja: - 有効にした場合、完了したタスクも累積フロー図に含められます。

source: Show and Hide Columns ---------------------
ja: カラムの表示/非表示 ---------------------

source: API Examples ============
ja: API の例 ============

source: Default method (HTTP Basic) ---------------------------
ja: デフォルトの方法 (HTTP Basic) ---------------------------

source: If you don’t want to have Kanboard with nice URLs, you can remove the file ``web.config``.
ja: Kanboard でURL Rewriteを利用しない場合、 ``web.config``ファイルを削除できます。

source: - Find tasks into several swim-lanes: ``swimlane:"Version 1.2" swimlane:"Version 1.3"``
ja: - 複数のスイムレーンからタスクを検索: ``swimlane:"Version 1.2" swimlane:"Version 1.3"``

source: The API use the `HTTP Basic Authentication Scheme described in the RFC2617 <http://www.ietf.org/rfc/rfc2617.txt>`__.
ja: APIは `RFC2617 <http://www.ietf.org/rfc/rfc2617.txt> `__ で説明されるHTTP Basic 認証スキームを使用します。

source: Attribute: **description** or **desc**
ja: 属性: **description** or **desc**

source: The virtual machine is based on Ubuntu 16.04 and PHP 7.
ja: この仮想マシンはUbuntu 16.04とPHP 7 がベースになっています。

source: // LDAP attribute for user language, example: 'preferredlanguage' // Put an empty string to disable language sync define('LDAP_USER_ATTRIBUTE_LANGUAGE', '');
ja: // LDAP 属性のユーザーの言語。例: 'preferredlanguage' // 言語を同期させないため、空の文字列を入れる define('LDAP_USER_ATTRIBUTE_LANGUAGE', '');

source: - ``isUserCreationAllowed()``: Return true to allow automatic user creation
ja: - ``isUserCreationAllowed()``: 自動でのユーザー作成を許容しtrueを返す

source: User API Specific Procedures ============================
ja: ユーザーAPI特有のプロシージャ ============================

source: - This option affects the column “total” of the table “project_daily_column_stats”
ja: - このオプションは"プロジェクトの毎日の統計"の表中の"合計"列に影響します。

source: - Bug Tracker: https://github.com/kanboard/kanboard/issues
ja: - バグトラッカー: https://github.com/kanboard/kanboard/issues

source: figure:: /_static/task-creation-board.png :alt: Task creation from the board
ja: figure:: /_static/task-creation-board.png :alt: ボードからタスクを作成

source: * Send a HTML email
ja: * HTML emailを送信する

source: First example with proxy mode:
ja: 最初の例はproxy モードです:

source: Add new console commands ------------------------
ja: 新しいコンソールのコマンドを追加 ------------------------

source: note:: - Building assets is not possible from the Kanboard’s archive, you have to clone the repository.
ja: 注意:: - Kanboardのアーカイブからアセットをビルドする事は出来ないので、リポジトリからクローンする必要があります。

source: figure:: /_static/subtask-status-done.png :alt: Subtask done
ja: figure:: /_static/subtask-status-done.png :alt: サブタスクは完了

source: - Display list of keyboard shortcuts = **?**
ja: - ショートカットキー一覧表示 = **?**

source: Comment creation:
ja: コメントの作成:

source: LDAP Group Synchronization ==========================
ja: LDAP のグループの同期 ==========================

source: - **Color**: Choose the color of the card.
ja: - **色**: カードの色を選択します。

source: These images are uploaded as attachments to the task.
ja: これらの画像はタスクへの添付としてアップロードされます。

source: Extending Access Map --------------------
ja: アクセスマップを展開する --------------------

source: By default, Kanboard will synchronize all fields (role, name, email…) except the username.
ja: デフォルトでは、Kanboard はユーザー名を除くすべてのフィールド (role, name, email...) を同期します。

source: There are only two constraints imposed by Kanban:
ja: かんばんは2つの制限のみを課します:

source: - Automatically update the start date
ja: - 開始日を自動的に更新

source: - Time spent in the origin column
ja: - 元のカラムでの経過時間

source: Project Analytics =================
ja: プロジェクトの分析 =================

source: - Destination column
ja: - 移動先カラム

source: This feature is mainly used for project permissions.
ja: この機能は主にプロジェクトの権限に使用します。

source: Go to the action drop-down or in the project settings and choose **custom filters**:
ja: ドロップダウンメニューかプロジェクト設定から、 **カスタムフィルタ** を選択してください:

source: css Minify CSS files
ja: css 最小限のCSSファイル

source: - Define the action parameters: **Column = To be validated** and **User = Bob** (Bob is our tester)
ja: - アクションのパラメータ: **カラム = To be validated** と、 **ユーザー = Bob** を定義 (Bobはテスト担当)

source: - **is a milestone of** \| targets milestone
ja: - **次のタスクのマイルストーンです** \| 次のマイルストーンを目標とします

source: The Access List (ACL) is based on the controller class name and the method name.
ja: アクセスリスト (ACL) はコントローラーのクラス名とメソッド名を基にしています。

source: - Project Viewer
ja: - プロジェクトビューアー

source: This object must implement the interface ``Kanboard\Core\User\UserProviderInterface``.
ja: このオブジェクトは ``Kanboard\Core\User\UserProviderInterface`` で実装されていなければなりません。

source: Uncomment extension directory:
ja: 拡張のディレクトリのコメント化を解除する:

source: And that
ja: それからやること

source: // Username of the admin, by default blank define('REVERSE_PROXY_DEFAULT_ADMIN', '');
ja: // 管理者のユーザー名。デフォルトは空白 define('REVERSE_PROXY_DEFAULT_ADMIN', '');

source: All internal events of Kanboard can be sent to an external URL.
ja: 全てのKanboard内部でのイベントは外部URLに送る事ができます。

source: Authentication Interfaces -------------------------
ja: 認証インターフェース -------------------------

source: Test your PHP installation:
ja: PHP のインストールのテスト*

source: Generate:
ja: 生成されたもの:

source: Search by event creator ~~~~~~~~~~~~~~~~~~~~~~~
ja: イベント作者で検索 ~~~~~~~~~~~~~~~~~~~~~~~

source: User Local Synchronization --------------------------
ja: ローカルのユーザーの同期 --------------------------

source: Kanban vs Scrum ---------------
ja: かんばん vs スクラム ---------------

source: - Switch to the list view = **v l**
ja: - リストビューに切り替え = **v l**

source: +-------------------------+-------------------------------------------------------+ | Path | Description | +=========================+=======================================================+ | ``/var/www/app/data`` | Application data (Sqlite database, attachments, etc.) | +-------------------------+-------------------------------------------------------+ | ``/var/www/app/plugins``| Plugins | +-------------------------+-------------------------------------------------------+ | ``/etc/nginx/ssl`` | SSL certificates | +-------------------------+-------------------------------------------------------+
ja: +-------------------------+-------------------------------------------------------+ | パス | 概要 | +=========================+=======================================================+ | /var/www/app/data | アプリケーションデータ (Sqliteのデータベース, 添付ファイルなど) | +-------------------------+-------------------------------------------------------+ | /var/www/app/plugins | プラグイン | +-------------------------+-------------------------------------------------------+ | /etc/nginx/ssl | SSL 証明書 | +-------------------------+-------------------------------------------------------+

source: - Operating System
ja: - OS

source: If you would like to create a new translation, follow these steps:
ja: 新しい翻訳を作成するには、以下のステップに従ってください:

source: - Check your spam folder
ja: - 迷惑メールフォルダをチェックする

source: Requirements ============
ja: 必要要件 ============

source: With the plugin API you can add a driver for any email provider.
ja: プラグインAPIによって、Email送信の方法を追加することができます。

source: # Download the latest release from https://github.com/kanboard/kanboard/releases wget https://github.com/kanboard/kanboard/archive/v<version>.zip
ja: # https://github.com/kanboard/kanboard/releases より最新リリースをダウンロードする wget https://github.com/kanboard/kanboard/archive/v<version>.zip

source: Authentication failure with the API and Apache + PHP-FPM --------------------------------------------------------
ja: Apache + PHP-FPM でAPIの認証が失敗する --------------------------------------------------------

source: - **name** (string, required, must be unique for the given project)
ja: - **name** (string, 必須, プロジェクトごとにユニークでなければならない)

source: - Choose the event: **Move a task to another column**
ja: - イベント **タスクを別のカラムに移動** を選択

source: - Contact the maintainers on the forum to add your translation to the list
ja: - フォーラムからメンテナに新しい翻訳を追加してもらうようためにコンタクトをとる

source: - Result on success: **List of projects with details**
ja: - 成功時の返り値: **詳細付きのプロジェクトのリスト**

source: - Result on success: **true**
ja: - 成功時の返り値: **true**

source: +----------------------------------------+---------------------------------------------------------------+ | Hook | Description | +========================================+===============================================================+ | ``formatter:board:query`` | Alter database query before rendering board | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:project:query`` | Alter database query for projects pagination on the dashboard | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:task:query`` | Alter database query for tasks pagination on the dashboard | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:subtask:query`` | Alter database query for subtasks pagination on the dashboard | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:creation:prepare`` | Alter form values before to save a task | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:creation:aftersave`` | Retrieve Task ID after creating a task | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:modification:prepare`` | Alter form values before to edit a task | +----------------------------------------+---------------------------------------------------------------+ | ``model:color:get-list`` | Alter default_colors values | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:modification:prepare`` | Alter form values before to save a subtask | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:creation:prepare`` | Alter form values before to edit a subtask | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:count:query`` | Alter database query for subtask count | +----------------------------------------+---------------------------------------------------------------+
ja: +----------------------------------------+---------------------------------------------------------------+ | フック | 概要 | +========================================+===============================================================+ | ``formatter:board:query`` | ボードのレンダリング前にデータベースのクエリを変更する | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:project:query`` | ダッシュボード上のプロジェクトの順序変更のためにデータベースのクエリを変更する | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:task:query`` | ダッシュボード上のタスクの順序変更のためにデータベースのクエリを変更する | +----------------------------------------+---------------------------------------------------------------+ | ``pagination:dashboard:subtask:query`` | ダッシュボード上のサブタスクの順序変更のためにデータベースのクエリを変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:creation:prepare`` | 値を保存する前にデータベースのクエリを変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:creation:aftersave`` | タスクを作成した後に、タスクIDを取得する | +----------------------------------------+---------------------------------------------------------------+ | ``model:task:modification:prepare`` | タスクを変更する前にフォームの値を変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:color:get-list`` | デフォルト色の値を変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:modification:prepare`` | サブタスクを変更する前にフォームの値を変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:creation:prepare`` | サブタスクを作成する前にフォームの値を変更する | +----------------------------------------+---------------------------------------------------------------+ | ``model:subtask:count:query`` | サブタスクをカウントする前にフォームの値を変更する | +----------------------------------------+---------------------------------------------------------------+

source: There is an `official Python client for Kanboard <https://github.com/kanboard/python-api-client>`__:
ja: これが `Kanboardの公式Pythonクライアント <https://github.com/kanboard/kanboard-api-client>`__ です:

source: // By default Kanboard lowercase the ldap username to avoid duplicate users (the database is case sensitive)
ja: // Kanboard はデフォルトではユーザーの重複回避のため、ldapのユーザー名は小文字になります (データベースは大文字と小文字を区別します )

source: Tags ----
ja: タグ ----

source: Settings ========
ja: 設定 ========

source: Tags API Procedures ===================
ja: タグのAPIプロシージャ ===================

source: This page hasn't been updated for a while, and it's probably obsolete.
ja: このページは長い間更新されておらず、古い可能性があります。

source: - ``Kanboard\Core\ExternalTask\ExternalTaskException``: Generic error related to the external system
ja: - ``Kanboard\Core\ExternalTask\ExternalTaskException``: 外部システムに起因する一般的なエラー

source: Board Settings --------------
ja: 基本設定 --------------

source: - Time spent
ja: - 経過時間

source: :ref:`Read the instructions <update-translations>`
ja: :ref:`<update-translations>のインストラクションを参照してください。`

source: If you don’t want to wait 15 minutes, you can unlock a user from the user interface.
ja: 15分も待てない場合、ユーザーインターフェースからロックを解除することができます。

source: Our LDAP server is ``myserver.example.com`` and is only accessible via LDAPS.
ja: 我々の LDAP サーバーは ``myserver.example.com`` で、LDAPS経由でのアクセスのみ可能です。

source: If no emails are sent and you are sure that everything is configured correctly:
ja: 設定が正しいにも関わらず、メールが送られてこない場合:

source: - Create a task from an external provider
ja: - タスクを外部サービスから作成

source: The downloaded database is compressed with Gzip, the filename becomes ``db.sqlite.gz``.
ja: ダウンロードされたデータベースは gzipで圧縮され、ファイル名は ``db.sqlite.gz`` になります。

source: - Purpose: **Get users that can be assigned to a task for a project**
ja: - 用途: **プロジェクトのタスクに割当可能なユーザーを取得する**

source: // Enable LDAP START_TLS define('LDAP_START_TLS', false);;
ja: // LDAP START_TLS を有効にする define('LDAP_START_TLS', false);;

source: Source ~~~~~~
ja: ソースコード ~~~~~~

source: - Ready
ja: - 準備済

source: Anonymous Mode ~~~~~~~~~~~~~~
ja: Anonymous モード ~~~~~~~~~~~~~~

source: This guide will help you to setup step by step Kanboard on a Windows Server with Apache and PHP.
ja: このガイドは、Windows Server上でApacheとPHPを利用してKanboardをセットアップするために順を追ったヘルプです。

source: - Mysql and Postgresql (optional)
ja: - Mysql と Postgresql (任意)

source: - Only the owner and administrators can access the project
ja: - プロジェクトの所有者とシステム管理者のみがプロジェクトにアクセスできます。

source: How to add a new plugin to the website?
ja: ウェブサイトに新しいプラグインを追加したいのですが？

source: The first letter of the plugin name must be capitalized.
ja: プラグイン名の頭文字は大文字にする必要があります。

source: Attribute: **color**
ja: 属性: **color**

source: - **fixes** \| is fixed by
ja: - **次を修正します** \| 次に修正されます

source: Solution: **Do not use underscore in the domain name because this is not a valid domain name**.
ja: 解決法: **有効なドメイン名とされないため、アンダースコアをドメイン名に使用しない**

source: - **relates to**
ja: - **次に関連します**

source: - Result on success: **file_id**
ja: - 成功時の返り値: **file_id**

source: - Wildcard search: ``ref:TICKET-*``
ja: - ワイルドカード検索: ``ref:TICKET-*``

source: To fit with the Kanban methodology, the recurring tasks are not based on a date but on board events.
ja: かんばん方法論において、反復タスクは日付には基づかないボード上のイベントです。

source: Search by score/complexity ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: スコア/複雑さで検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: db:migrate Execute SQL migrations
ja: db:migrate SQL マイグレーションを実行

source: - Always write PHPdoc comments for methods and class properties
ja: - 常にメソッドとクラスのプロパティにPHPdoc のコメントを付ける

source: - Find all tasks that have those categories:
ja: - これらのカテゴリに該当する全てのタスクを検索:

source: Attribute: **column**
ja: 属性: **column**

source: Go to “Administrative Tools” 2.
ja: “管理ツール”を開く 2.

source: figure:: /_static/new_custom_role.png :alt: New custom role
ja: figure:: /_static/new_custom_role.png :alt: 新しい役割を追加

source: note:: The recommended operating system is GNU/Linux (Debian/Ubuntu/RHEL/Alpine Linux).
ja: 注意:: 推奨するOSは GNU/Linux (Debian/Ubuntu/RHEL/Alpine Linux) です。

source: - Purpose: **Get all external links attached to a task**
ja: - 用途: **タスクに添付された全ての外部リンクを取得する**

source: // LDAP group filter
ja: // LDAP グループフィルター

source: - **recurrence_basedate** (integer, optional)
ja: - **recurrence_basedate** (integer, 任意)

source: - Choose action: **Assign the task to the person who does the action when the column is changed**
ja: - アクション: **アクションを起こしたユーザーを担当者にする**を選択

source: The Authorization class (``Kanboard\Core\Security\Authorization``) will check the access for each page.
ja: 認可クラス (``Kanboard\Core\Security\Authorization``) は個々のページごとにアクセスをチェックします。

source: Some servers will reject emails based on the hostname transmitted with the HELO (EHLO) command (see RFC 5321).
ja: いくつかのサーバーはHELO(EHLO)コマンドを利用してホスト名に基づくemailの通信を拒否しています(RFC 5321を参照

source: Tasks can be linked together with pre-defined relationships:
ja: 予め定義された関係性でタスク同士をリンクすることができます:

source: I have the error “There is no suitable CSPRNG installed on your system” -----------------------------------------------------------------------
ja: “There is no suitable CSPRNG installed on your system” エラーが出る -----------------------------------------------------------------------

source: Import/Restoration ------------------
ja: インポート/復元 ------------------

source: You can change the directory URL in the config file.
ja: 設定ファイル内で、ディレクトリのURLを変更できます。

source: Optimization ------------
ja: 最適化 ------------

source: - Purpose: **Enable public access for a given project**
ja: - 用途: **プロジェクトの公開アクセスを有効化する**

source: LDAP Queries ------------
ja: LDAP のクエリ ------------

source: Due dates, if set on the current task, can be recalculated by a given factor of days, months or years.
ja: 現在のタスクに期限が設定されていれば、新しい期限を再計算するための要素として日数、月数、年数を設定できます。

source: Task relations can be changed from the application settings (**Settings > Link settings**)
ja: タスクの関連性はアプリケーション設定から変更できます ( **設定 > リンクラベル** )

source: - Purpose: **Get time spent on a subtask for a user**
ja: - 用途: **ユーザーがサブタスクに費やした時間を取得する**

source: - Swimlanes
ja: - スイムレーン

source: - Purpose: **Remove all files associated to a task**
ja: - 用途: **タスクに関連する全てのファイルを削除する**

source: - Result on success: **list of task link**
ja: - 成功時の返り値: **タスクのリンクのリスト**

source: // Hide login form, useful if all your users use Google/Github/ReverseProxy authentication define('HIDE_LOGIN_FORM', false);
ja: // ログインフォームの非表示。全てのユーザーがGoogle/Github/リバースプロキシ認証を使用する場合に有用。 define('HIDE_LOGIN_FORM', false);

source: This feature is useful to run commands outside of the web server processes.
ja: この特徴は、webサーバーの外のプロセスでコマンドを実行するのに便利です。

source: The file ``config.php`` should contain those values:
ja: ``config.php`` にはこれらの値が含まれるべきです:

source: Be sure to allow the user ``postgres`` to create and drop databases.
ja: ユーザー ``postgres`` に、データベースの生成と破棄を許可する必要があります。

source: Put that in the French locale and sync other locales (see below).
ja: フランス語ロケールと他のロケールを同期させます(後述)。

source: // By default, the log file is in data/debug.log but you can change the path:
ja: // デフォルトでは、ログは data/debug.logに保存されますが、変更することもできます:

source: By default, when you create tags from a task form they are associated to the current project:
ja: デフォルトでは、タスクのフォームから作成したタグは、現在のプロジェクトに関連付けられます:

source: - New task = **n**
ja: - 新しいタスクを作成 = **n**

source: - Purpose: **Get a single column**
ja: - 用途: **一つのカラムについて取得する**

source: A public board **cannot be modified: it has read-only access**.
ja: 公開ボードでは **閲覧のみ可能で、変更はできません**

source: figure:: /_static/custom_roles.png :alt: Custom project role
ja: figure:: /_static/custom_roles.png :alt: プロジェクト独自の役割

source: - Execute ``vagrant up``
ja: - ``vagrant up`` を実行する

source: #adapt version number
ja: #適用するバージョン番号r

source: - Traditional web page
ja: - (古典的な)webページ

source: Synchronize user information if necessary
ja: 必要ならば、ユーザー情報を同期します。

source: You can try Kanboard with Vagrant very easily:
ja: Vagrantを使用してKanboardを試用することはとても簡単です:

source: - `Spanish <https://github.com/kanboard/documentation-es>`_
ja: - `スペイン語 <https://github.com/kanboard/documentation-es>`_

source: Project Views -------------
ja: プロジェクトビュー -------------

source: The first argument is the original template name and the second argument the template to use as replacement.
ja: 最初の引数は元のテンプレート名で、2つ目の引数は置き換えに使うテンプレートです。

source: These custom roles are defined for each project.
ja: これらの独自の役割は、個々のプロジェクト毎に定義されます。

source: - A ``PDO`` instance is passed as first argument
ja: - ``PDO`` インスタンスは最初の引数をパスします・

source: - **query** (string, required)
ja: - **query** (string, 必須)
